ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8eac9a31-ed8b-4965-85f9-086b89e1764b">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="d59a9f62-153a-481d-bab6-3f178d0606f1">
    <name>ЗаказКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c6d7cf2e-b9f9-4ff3-8578-9b565c26699e">
    <name>ДоверенностьНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="8139626e-8ad5-43ef-8108-a207607b40b5">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6067ffa5-2788-47af-b233-3eaecb858e38">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c3e7b9be-3656-4800-8e46-0709bd569743">
      <name>ЗаказКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="8b5edf9d-182d-49ae-acc0-af59ac327193">
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="05936dfd-7396-410f-88bf-a2c6c4adf099">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/ВнутреннееПотребление/ВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b726b4a4-d691-4fa0-bef7-e6f1bd056cbf">
  <name>ВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.vs_Доизготовление</registerRecords>
  <registerRecords>AccumulationRegister.ИТБК_Доизготовление</registerRecords>
  <attributes>
    <name>vs_СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8f13106d-31d1-441b-8330-ef025f55fdbf">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7bab1076-c626-4662-b814-ed3a1973efb8">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e12d08bd-1d79-40a7-b21c-f669b1a7094b">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="930f6e33-ad27-42aa-847a-055d575b4e7a">
    <name>ИТБК_АктИзготовления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>vs_АктИзготовления</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_ЭтоДоизготовление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_Статус</name>
    <type>
      <types>EnumRef.СтатусыСборокТоваров</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6ac93f4f-ec62-46e7-b4ca-38e795bf02db">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e50af2f-d7e6-4349-bd07-de9f379b59ea">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bf2417c-ed59-4c71-a254-2f2338f41425">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="22ea815e-ceda-4730-8b5e-62907ac780b9">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="385ab3ce-dd41-4c25-b89b-974bb478f380">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0da3af76-0f90-43fc-bf8d-6d86f1169900">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a7dbbbcd-b6fb-4d47-96b7-edcd8cf2d437">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3dc4c4e8-1141-4c3c-95fd-9a8722f0d2d8">
      <name>ЗаказНаВнутреннееПотребление</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>vs_Доизготовление</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяДоизготовить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/CommonModules/МодификацияКонфигурацииКлиентПереопределяемый/Module.bsl
&После("ВыполнитьПереопределяемуюКоманду")
Процедура vs_ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры)
	Если Форма.ИмяФормы	= "Документ.СчетФактураВыданный.Форма.ФормаДокумента" Тогда
		Если Команда.Имя = "ПредставлениеНомера" Тогда
			Объект = Форма.Объект;
			Объект.ПредставлениеНомера = СокрЛП(Объект.ПредставлениеНомера);  
			ПредставлениеНомера = Объект.ПредставлениеНомера;
			Если ЗначениеЗаполнено(ПредставлениеНомера) Тогда
				ДлинаНомера = СтрДлина(Объект.Номер);
				СтандартнаяОбработка = Истина;
				Префикс = "00КА-";  // 87158109C874F5EC58B55558DF4EDC40   "Авто_3E08091877A5277BEC2619EF47395CBB"
				//СерверныйКонтекст = Новый Структура;
				//СерверныйКонтекст.Вставить("ПараметрКоманды"	, Команда.Имя);
				//СерверныйКонтекст.Вставить("ИмяКомандыВФорме"	, Команда.Имя);
				//СерверныйКонтекст.Вставить("Результат"			, Префикс);
				//Форма.Подключаемый_ВыполнитьКомандуНаСервере(СерверныйКонтекст, Префикс);
				////ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(Форма.Объект, СтандартнаяОбработка, Префикс);
				Объект.Номер = СтрШаблон("%1%2%3", Префикс, Сред("000000000000000000000000", 1, (ДлинаНомера - 5 - СтрДлина(ПредставлениеНомера))), ПредставлениеНомера);	
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Форма.ИмяФормы	= "Документ.СчетФактураВыданныйАванс.Форма.ФормаДокументаРФ" Тогда
		Объект = Форма.Объект;
		Если Команда.Имя = "ПредставлениеНомера" Тогда
			Объект.ПредставлениеНомера = СокрЛП(Объект.ПредставлениеНомера);  
			ПредставлениеНомера = Объект.ПредставлениеНомера;
			// begin fix Designer 2026.02.25
			Для Индекс = 1 По СтрДлина(ПредставлениеНомера) Цикл
				КодСимвола = КодСимвола(Лев(ПредставлениеНомера, 1));
				Если (Не КодСимвола < 48 И Не КодСимвола > 57) Тогда
					Прервать;
				КонецЕсли;
				ПредставлениеНомера = Сред(ПредставлениеНомера,2);
			КонецЦикла;
			// end fix Designer 2026.02.25
			Если ЗначениеЗаполнено(ПредставлениеНомера) Тогда
				ДлинаНомера = СтрДлина(Объект.Номер);
				СтандартнаяОбработка = Истина;
				Префикс = "00КА-А";  // 87158109C874F5EC58B55558DF4EDC40   "Авто_3E08091877A5277BEC2619EF47395CBB"
				//СерверныйКонтекст = Новый Структура;
				//СерверныйКонтекст.Вставить("ПараметрКоманды"	, Команда.Имя);
				//СерверныйКонтекст.Вставить("ИмяКомандыВФорме"	, Команда.Имя);
				//СерверныйКонтекст.Вставить("Результат"			, Префикс);
				//Форма.Подключаемый_ВыполнитьКомандуНаСервере(СерверныйКонтекст, Префикс);
				////ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(Форма.Объект, СтандартнаяОбработка, Префикс);
				Объект.Номер = СтрШаблон("%1%2%3", Префикс, Сред("000000000000000000000000", 1, (ДлинаНомера - 6 - СтрДлина(ПредставлениеНомера))), ПредставлениеНомера);	
				Объект.ПредставлениеНомера = СтрШаблон("%1%2", "А", ПредставлениеНомера);
			КонецЕсли;
		ИначеЕсли Команда.Имя = "Номер" Тогда
			//Объект.ПредставлениеНомера = Документы.СчетФактураВыданныйАванс.vs_ПолучитьПредставлениеНомера(ТекущийОбъект);
			Объект.ПредставлениеНомера = СтрШаблон("А%1",ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(
			Объект.Номер, Истина, Истина));
		КонецЕсли;
	ИначеЕсли Форма.ИмяФормы	= "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		Если Команда.Имя = "Номер" Тогда
			ПредставлениеНомера = СокрЛП(Форма.Объект.Номер);  
			Форма.Объект.Номер = ПредставлениеНомера;
			Если ЗначениеЗаполнено(ПредставлениеНомера) Тогда
				ДлинаНомера = СтрДлина(Форма.Объект.Номер);
				СтандартнаяОбработка = Истина;
				Префикс = "00КА-";  // 87158109C874F5EC58B55558DF4EDC40   "Авто_3E08091877A5277BEC2619EF47395CBB"
				//СерверныйКонтекст = Новый Структура;
				//СерверныйКонтекст.Вставить("ПараметрКоманды"	, Команда.Имя);
				//СерверныйКонтекст.Вставить("ИмяКомандыВФорме"	, Команда.Имя);
				//СерверныйКонтекст.Вставить("Результат"			, Префикс);
				//Форма.Подключаемый_ВыполнитьКомандуНаСервере(СерверныйКонтекст, Префикс);
				////ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(Форма.Объект, СтандартнаяОбработка, Префикс);
				Форма.Объект.Номер = СтрШаблон("%1%2%3", Префикс, Сред("000000000000000000000000", 1, (ДлинаНомера - 5 - СтрДлина(ПредставлениеНомера))), ПредставлениеНомера);	
			КонецЕсли;
		ИначеЕсли Команда.Имя = "РеквизитыПечати" Тогда
		
			Попытка
				Форма.ЗаблокироватьДанныеФормыДляРедактирования();
			Исключение
				ПоказатьПредупреждение(Неопределено, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				Возврат;
			КонецПопытки;
			////////////////////////////////
			Объект = Форма.Объект;
			////////////////////////////////
			ДанныеРаспоряженияНаДоставку = ДоставкаТоваровКлиентСервер.ПараметрыРаспоряжения();
			ЗаполнитьЗначенияСвойств(ДанныеРаспоряженияНаДоставку, Объект);
			
			СтруктураПараметров = Новый Структура();
			СтруктураПараметров.Вставить("АдресДоставки",                   Объект.АдресДоставки);
			СтруктураПараметров.Вставить("АдресДоставкиЗначенияПолей",      Объект.АдресДоставкиЗначенияПолей);
			СтруктураПараметров.Вставить("ЗонаДоставки",                    Объект.ЗонаДоставки);
			СтруктураПараметров.Вставить("ВремяДоставкиС",                  Объект.ВремяДоставкиС);
			СтруктураПараметров.Вставить("ВремяДоставкиПо",                 Объект.ВремяДоставкиПо);
			СтруктураПараметров.Вставить("ДополнительнаяИнформацияПоДоставке", Объект.ДополнительнаяИнформацияПоДоставке);
			СтруктураПараметров.Вставить("ДанныеРаспоряженияНаДоставку",    ДанныеРаспоряженияНаДоставку);
			СтруктураПараметров.Вставить("Ссылка",                          Объект.Ссылка);
			СтруктураПараметров.Вставить("БанковскийСчетГрузоотправителя",  Объект.БанковскийСчетГрузоотправителя);
			СтруктураПараметров.Вставить("БанковскийСчетГрузополучателя",   Объект.БанковскийСчетГрузополучателя);
			СтруктураПараметров.Вставить("БанковскийСчетКонтрагента",       Объект.БанковскийСчетКонтрагента);
			СтруктураПараметров.Вставить("Грузоотправитель",                Объект.Грузоотправитель);
			СтруктураПараметров.Вставить("Грузополучатель",                 Объект.Грузополучатель);
			СтруктураПараметров.Вставить("ДоверенностьВыдана",              Объект.ДоверенностьВыдана);
			СтруктураПараметров.Вставить("ДоверенностьДата",                Объект.ДоверенностьДата);
			СтруктураПараметров.Вставить("ДоверенностьЛицо",                Объект.ДоверенностьЛицо);
			СтруктураПараметров.Вставить("ДоверенностьНомер",               Объект.ДоверенностьНомер);
			СтруктураПараметров.Вставить("Договор",                         Объект.Договор);
			СтруктураПараметров.Вставить("Основание",                       Объект.Основание);
			СтруктураПараметров.Вставить("ОснованиеДата",                   Объект.ОснованиеДата);
			СтруктураПараметров.Вставить("ОснованиеНомер",                  Объект.ОснованиеНомер);
			СтруктураПараметров.Вставить("Отпустил",                        Объект.Отпустил);
			СтруктураПараметров.Вставить("ОтпустилДолжность",               Объект.ОтпустилДолжность);
			СтруктураПараметров.Вставить("Партнер",                         Объект.Партнер);
			СтруктураПараметров.Вставить("ХозяйственнаяОперация",           Объект.ХозяйственнаяОперация);
			СтруктураПараметров.Вставить("Контрагент",                      Объект.Контрагент);
			////////////////////////////////
			СтруктураПараметров.Вставить("ТолькоПросмотр",                  Форма.ТолькоПросмотр);
			////////////////////////////////
			СтруктураПараметров.Вставить("ТипОбъекта",                     "РеализацияТоваровУслуг");
			СтруктураПараметров.Вставить("РеализацияПоЗаказам",             Объект.РеализацияПоЗаказам);
			СтруктураПараметров.Вставить("БанковскийСчетОрганизации",       Объект.БанковскийСчетОрганизации);
			СтруктураПараметров.Вставить("Организация",                     Объект.Организация);
			СтруктураПараметров.Вставить("Дата",                            Объект.Дата);
			СтруктураПараметров.Вставить("Руководитель",                    Объект.Руководитель);
			СтруктураПараметров.Вставить("ГлавныйБухгалтер",                Объект.ГлавныйБухгалтер);
			////////////////////////////////
			СтруктураПараметров.Вставить("ТаблицаОснованийДляПечати",       Форма.ТаблицаОснованийДляПечати);
			////////////////////////////////
			//++ Локализация
			СтруктураПараметров.Вставить("КодСпециальныхОбстоятельств",     Объект.КодСпециальныхОбстоятельств);
			//-- Локализация
			СтруктураПараметров.Вставить("СведенияОТранспортировкеИГрузе",  Объект.СведенияОТранспортировкеИГрузе);
			СтруктураПараметров.Вставить("СопроводительныеДокументы",       Объект.СопроводительныеДокументы);
			////////////////////////////////
			СтруктураПараметров.Вставить("РеализацияЧерезКомиссионера",     Форма.РеализацияЧерезКомиссионера);
			////////////////////////////////
			////////////////////////////////
			ОбщаяФормаРеквизитыПечатиРеализации = ПолучитьФорму("ОбщаяФорма.РеквизитыПечатиРеализации", СтруктураПараметров, Форма, Объект);//, <Окно>, <НавигационнаяСсылка>)
			
			//ПараметрыСтроки = Новый КвалификаторыСтроки(30,ДопустимаяДлина.Переменная);
			//НашеОписание = Новый ОписаниеТипов("Строка",,ПараметрыСтроки);
			//ОбщаяФормаРеквизитыПечатиРеализации.Элементы.ДоверенностьНомер.ОграничениеТипа = НашеОписание;
			//ОбщаяФормаРеквизитыПечатиРеализации.Параметры.ДоверенностьНомер = 
			//	ОбщаяФормаРеквизитыПечатиРеализации.Элементы.ДоверенностьНомер.ОграничениеТипа.ПривестиЗначение(ОбщаяФормаРеквизитыПечатиРеализации.Параметры.ДоверенностьНомер);
			////ОбщаяФормаРеквизитыПечатиРеализации 
			ОбщаяФормаРеквизитыПечатиРеализации.vs_ДоверенностьНомер = Объект.ДоверенностьНомер;
			ОбщаяФормаРеквизитыПечатиРеализации.Открыть();
			//ОткрытьФорму("ОбщаяФорма.РеквизитыПечатиРеализации", СтруктураПараметров, ЭтотОбъект,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			////////////////////////////////
		КонецЕсли;
	ИначеЕсли Форма.ИмяФормы	= "Документ.АктВыполненныхРабот.Форма.ФормаДокумента" Тогда
		Если Команда.Имя = "Номер" Тогда
			ПредставлениеНомера = СокрЛП(Форма.Объект.Номер);  
			Форма.Объект.Номер = ПредставлениеНомера;
			Если ЗначениеЗаполнено(ПредставлениеНомера) Тогда
				ДлинаНомера = СтрДлина(Форма.Объект.Номер);
				СтандартнаяОбработка = Истина;
				Префикс = "00КА-";  // 87158109C874F5EC58B55558DF4EDC40   "Авто_3E08091877A5277BEC2619EF47395CBB"
				//СерверныйКонтекст = Новый Структура;
				//СерверныйКонтекст.Вставить("ПараметрКоманды"	, Команда.Имя);
				//СерверныйКонтекст.Вставить("ИмяКомандыВФорме"	, Команда.Имя);
				//СерверныйКонтекст.Вставить("Результат"			, Префикс);
				//Форма.Подключаемый_ВыполнитьКомандуНаСервере(СерверныйКонтекст, Префикс);
				////ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(Форма.Объект, СтандартнаяОбработка, Префикс);
				Форма.Объект.Номер = СтрШаблон("%1%2%3", Префикс, Сред("000000000000000000000000", 1, (ДлинаНомера - 5 - СтрДлина(ПредставлениеНомера))), ПредставлениеНомера);	
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Форма.ИмяФормы	= "Документ.ВнутреннееПотребление.Форма.ФормаДокумента" Тогда
		Если Команда.Имя = "vs_СтатьяРасходов" Тогда
			Объект = Форма.Объект;
			vs_СтатьяРасходов = Объект.vs_СтатьяРасходов;
			Для каждого Стр Из Объект.Товары Цикл
				Стр.СтатьяРасходов = vs_СтатьяРасходов;
			КонецЦикла;
		КонецЕсли;
		
	//ИначеЕсли Форма.ИмяФормы	= "Отчет.vs_МатериальныйОтчет.Форма" Тогда
	//	Если Команда.Имя = "vs_ОтразитьМатериальныйОтчет" Тогда
	//		//Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ОтчетСформирован")
	//		//	и ТипЗнч(Форма.ОтчетСформирован) = Тип("Булево") и Форма.ОтчетСформирован Тогда
	//		//
	//		//Иначе
	//		//	ОбщегоНазначенияКлиент.СообщитьПользователю("Сначала сформируйте отчет!",, "СформироватьОтчет");
	//		//КонецЕсли; 
	//		Контекст = Новый Структура;
	//		Контекст.Вставить("Результат", Результат);
	//		Контекст.Вставить("ПараметрыФормирования", ПараметрыФормирования);
	//		Контекст.Вставить("НастройкаОтказаОтПредупреждения", Неопределено);
	//		МодификацияКонфигурацииВызовСервераПереопределяемый.vs_МатериальныйОтчет_СкомпоноватьРезультат(Форма, Команда, ДополнительныеПараметры);
	//	КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
